InformationRegisters/СтоимостиКонсерна.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.СтоимостиКонсерна" category="Record">				<xr:TypeId>722e197e-3c05-4bfd-a2fd-767dc8d4e76c</xr:TypeId>				<xr:ValueId>ae2c0628-a9d8-4f30-8a79-04d9ce4a4e53</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.СтоимостиКонсерна" category="Manager">				<xr:TypeId>95a5d291-8d4c-46aa-a4d2-bd03e32eb420</xr:TypeId>				<xr:ValueId>42482483-7a38-4192-91f6-d628973a2115</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.СтоимостиКонсерна" category="Selection">				<xr:TypeId>75b67967-d148-40ce-b6e8-f2bbb8900d91</xr:TypeId>				<xr:ValueId>47b6785d-6fe5-429e-9100-4c59be3b4a0d</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.СтоимостиКонсерна" category="List">				<xr:TypeId>3f46897b-c101-449d-ad87-07f3ac45085b</xr:TypeId>				<xr:ValueId>c2f8b7b1-67d0-4122-b16b-c420b0f3087a</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.СтоимостиКонсерна" category="RecordSet">				<xr:TypeId>9ddf0d57-dee6-4dd2-ac8a-ab47f607707d</xr:TypeId>				<xr:ValueId>1a337cf7-e06e-46da-8e10-31433a447f0e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.СтоимостиКонсерна" category="RecordKey">				<xr:TypeId>33270502-d47d-4702-9cc8-7b92a4487805</xr:TypeId>				<xr:ValueId>32b51476-acb3-4811-a676-cbfd5b0b983b</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.СтоимостиКонсерна" category="RecordManager">				<xr:TypeId>7baae9b4-b212-4be3-a1a4-d415a0a68a10</xr:TypeId>				<xr:ValueId>d00a3280-2f2d-46b2-99d8-d6a30959ccf9</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>СтоимостиКонсерна</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Стоимости консерна</v8:content>				</v8:item>			</Synonym>			<Comment>Список стоимостей консерна для интерфейса Инспектора</Comment>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm>InformationRegister.СтоимостиКонсерна.Form.ФормаЗаписи</DefaultRecordForm>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<StandardAttributes>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>			<WriteMode>Independent</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>СтоимостьКонсерна</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Стоимость консерна</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>4</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>УИД</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>УИД</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>v8:UUID</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>false</MainFilter>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>DontUse</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Form>ФормаЗаписи</Form>		</ChildObjects>	</InformationRegister></MetaDataObject>

InformationRegisters/СтоимостиКонсерна/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСтоимостьПоУИД(УИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	СтоимостиКонсерна.СтоимостьКонсерна КАК СтоимостьКонсерна
	|ИЗ
	|	РегистрСведений.СтоимостиКонсерна КАК СтоимостиКонсерна
	|ГДЕ
	|	СтоимостиКонсерна.УИД = &УИД";
	
	Запрос.УстановитьПараметр("УИД", УИД);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		//Ошибка
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.СтоимостьКонсерна;
	
КонецФункции

// Получить все списком значений.
// 
// Возвращаемое значение:
//  СписокЗначений - Получить все списком значений
Функция ПолучитьВсеСпискомЗначений() Экспорт
	
	СписокСтоимостей = Новый СписокЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтоимостиКонсерна.СтоимостьКонсерна КАК СтоимостьКонсерна
		|ИЗ
		|	РегистрСведений.СтоимостиКонсерна КАК СтоимостиКонсерна
		|УПОРЯДОЧИТЬ ПО
		|	СтоимостьКонсерна";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СписокСтоимостей.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СтоимостьКонсерна"));	
	КонецЕсли;
	
	Возврат СписокСтоимостей;
	
КонецФункции

#КонецОбласти

#КонецЕсли
